; domain
; PolyCraft advanced domain

(define (domain ceramicsstudio)

    (:requirements :strips :typing :negative-preconditions :fluents :disjunctive-preconditions)

    (:types
        tile - object
    )

    (:constants
        kiln_block - tile
    )

    (:predicates
        (standing_on ?c - tile)

        ; Map
        (clay_tile ?c - tile)
        (empty_tile ?c - tile)
        (kiln_tile ?c - tile)
        (have_fired_vase)
    )

    (:functions
        ; Items
        (count_raw_clay_on_shelf)
        (count_wedged_clay_on_shelf)
        (count_coils_on_shelf)
        (count_glaze_jar_on_shelf)
        (count_bisque_mold_on_shelf)
    )

    ; Actions
    (:action walk_to
        :parameters (?from - tile ?to - tile)
        :precondition (and
            (standing_on ?from)
        )
        :effect (and
            (not (standing_on ?from))
            (standing_on ?to)
        )
    )

    (:action dig_clay
        :parameters (?pos - tile)
        :precondition (and
            (standing_on ?pos)
            (clay_tile ?pos)
        )
        :effect (and
            (not (clay_tile ?pos))
            (empty_tile ?pos)
            (increase (count_raw_clay_on_shelf) 1)
        )
    )

    (:action wedge_clay
        :parameters ()
        :precondition (and
            (>= (count_raw_clay_on_shelf) 1)
        )
        :effect (and
            (decrease (count_raw_clay_on_shelf) 1)
            (increase (count_wedged_clay_on_shelf) 4)
        )
    )

    (:action roll_coil
        :parameters ()
        :precondition (and
            (>= (count_wedged_clay_on_shelf) 2)
        )
        :effect (and
            (decrease (count_wedged_clay_on_shelf) 2)
            (increase (count_coils_on_shelf) 4)
        )
    )

    (:action shape_bisque_mold
        :parameters (?pos - tile)
        :precondition (and
            (standing_on ?pos)
            (not (standing_on kiln_block))
            (>= (count_wedged_clay_on_shelf) 5)
            (>= (count_coils_on_shelf) 1)
        )
        :effect (and
            (not (standing_on ?pos))
            (standing_on kiln_block)
            (decrease (count_wedged_clay_on_shelf) 5)
            (decrease (count_coils_on_shelf) 1)
            (increase (count_bisque_mold_on_shelf) 1)
        )
    )

    (:action throw_vase
        :parameters (?pos - tile)
        :precondition (and
            (standing_on ?pos)
            (not (standing_on kiln_block))
            (>= (count_wedged_clay_on_shelf) 2)
            (>= (count_coils_on_shelf) 4)
            (>= (count_glaze_jar_on_shelf) 1)
        )
        :effect (and
            (not (standing_on ?pos))
            (standing_on kiln_block)
            (decrease (count_wedged_clay_on_shelf) 2)
            (decrease (count_coils_on_shelf) 4)
            (decrease
                (count_glaze_jar_on_shelf)
                1)
            (have_fired_vase)
        )
    )

    (:action apply_glaze
        :parameters (?pos - tile)
        :precondition (and
            (standing_on ?pos)
            (clay_tile ?pos)
            (>= (count_bisque_mold_on_shelf) 1)
        )
        :effect (and
            (increase
                (count_glaze_jar_on_shelf)
                1)
        )
    )

)

; problem
(define (problem ceramicsstudio-p05)
	(:domain ceramicsstudio)
	(:objects
		tile0 tile1 tile2 tile3 tile4 tile5 tile6 tile7 tile8 tile9 tile10 tile11 tile12 tile14 tile15 tile16 tile17 tile18 tile19 tile20 tile21 tile22 tile23 tile24 tile25 tile26 tile27 tile28 tile29 tile30 tile31 tile32 tile33 tile34 tile35 - tile
	)
	(:init (standing_on tile22) (empty_tile tile0) (empty_tile tile1) (empty_tile tile2) (empty_tile tile3) (empty_tile tile4) (empty_tile tile5) (empty_tile tile6) (empty_tile tile7) (empty_tile tile8) (empty_tile tile9) (empty_tile tile10) (empty_tile tile11) (empty_tile tile12) (empty_tile tile16) (empty_tile tile17) (empty_tile tile18) (empty_tile tile19) (empty_tile tile20) (empty_tile tile21) (empty_tile tile22) (empty_tile tile23) (empty_tile tile24) (empty_tile tile25) (empty_tile tile26) (empty_tile tile27) (empty_tile tile28) (empty_tile tile29) (empty_tile tile30) (empty_tile tile31) (empty_tile tile32) (empty_tile tile33) (empty_tile tile34) (empty_tile tile35) (clay_tile tile15) (clay_tile tile14)
		(kiln_tile kiln_block) (= (count_raw_clay_on_shelf) 3) (= (count_wedged_clay_on_shelf) 8) (= (count_coils_on_shelf) 0) (= (count_glaze_jar_on_shelf) 0) (= (count_bisque_mold_on_shelf) 0)
	)
	(:goal
		(and
			(have_fired_vase)
		)
	)
)

; plan
1. (roll_coil)
   changed: (count_wedged_clay_on_shelf) from 8 to 6, (count_coils_on_shelf) from 0 to 4
   goals met: 0 of 1
2. (walk_to tile22 tile14)
   deleted: (standing_on tile22)
   added: (standing_on tile14)
   goals met: 0 of 1
3. (wedge_clay)
   changed: (count_raw_clay_on_shelf) from 3 to 2, (count_wedged_clay_on_shelf) from 6 to 10
   goals met: 0 of 1
4. (roll_coil)
   changed: (count_wedged_clay_on_shelf) from 10 to 8, (count_coils_on_shelf) from 4 to 8
   goals met: 0 of 1
5. (wedge_clay)
   changed: (count_raw_clay_on_shelf) from 2 to 1, (count_wedged_clay_on_shelf) from 8 to 12
   goals met: 0 of 1
6. (dig_clay tile14)
   deleted: (clay_tile tile14)
   added: (empty_tile tile14)
   changed: (count_raw_clay_on_shelf) from 1 to 2
   goals met: 0 of 1
7. (walk_to tile14 tile15)
   deleted: (standing_on tile14)
   added: (standing_on tile15)
   goals met: 0 of 1
8. (roll_coil)
   changed: (count_wedged_clay_on_shelf) from 12 to 10, (count_coils_on_shelf) from 8 to 12
   goals met: 0 of 1
9. (roll_coil)
   changed: (count_wedged_clay_on_shelf) from 10 to 8, (count_coils_on_shelf) from 12 to 16
   goals met: 0 of 1
10. (roll_coil)
   changed: (count_wedged_clay_on_shelf) from 8 to 6, (count_coils_on_shelf) from 16 to 20
   goals met: 0 of 1
11. (wedge_clay)
   changed: (count_raw_clay_on_shelf) from 2 to 1, (count_wedged_clay_on_shelf) from 6 to 10
   goals met: 0 of 1
12. (roll_coil)
   changed: (count_wedged_clay_on_shelf) from 10 to 8, (count_coils_on_shelf) from 20 to 24
   goals met: 0 of 1
13. (roll_coil)
   changed: (count_wedged_clay_on_shelf) from 8 to 6, (count_coils_on_shelf) from 24 to 28
   goals met: 0 of 1
14. (wedge_clay)
   changed: (count_raw_clay_on_shelf) from 1 to 0, (count_wedged_clay_on_shelf) from 6 to 10
   goals met: 0 of 1
15. (shape_bisque_mold tile15)
   deleted: (standing_on tile15)
   added: (standing_on kiln_block)
   changed: (count_wedged_clay_on_shelf) from 10 to 5, (count_coils_on_shelf) from 28 to 27, (count_bisque_mold_on_shelf) from 0 to 1
   goals met: 0 of 1
16. (walk_to kiln_block tile15)
   deleted: (standing_on kiln_block)
   added: (standing_on tile15)
   goals met: 0 of 1
17. (apply_glaze tile15)
   changed: (count_glaze_jar_on_shelf) from 0 to 1
   goals met: 0 of 1
18. (throw_vase tile15)
   deleted: (standing_on tile15)
   added: (standing_on kiln_block) (have_fired_vase)
   changed: (count_wedged_clay_on_shelf) from 5 to 3, (count_coils_on_shelf) from 27 to 23, (count_glaze_jar_on_shelf) from 1 to 0
   goals met: 1 of 1
